一支股票数据集有一张表onestock，存放在dataset数据库/模式中，描述了某支股票的历史行情：

onestock(date_, open, high, low, close, volume, adjclose)

In [3]:
mysql://stu2101213030:stu2101213030@162.105.146.37:43306

In [5]:
show databases;

,Database
0,dataset
1,information_schema
2,stu2101213030

In [6]:
use dataset;

In [8]:
show tables;

,Tables_in_dataset
0,SurnameOrigin
1,stock
2,titanic_gender_submission
3,titanic_test
4,titanic_train

In [9]:
select * from stock limit 10;

,date_,open,high,low,close,volume,adjclose
0,1970-01-02,92.06,93.54,91.79,93.00,8050000,93.00
1,1970-01-05,93.00,94.25,92.53,93.46,11490000,93.46
2,1970-01-06,93.46,93.81,92.13,92.82,11460000,92.82
3,1970-01-07,92.82,93.38,91.93,92.63,10010000,92.63
4,1970-01-08,92.63,93.47,91.99,92.68,10670000,92.68
5,1970-01-09,92.68,93.25,91.82,92.40,9380000,92.40
6,1970-01-12,92.40,92.67,91.20,91.70,8900000,91.70
7,1970-01-13,91.70,92.61,90.99,91.92,9870000,91.92
8,1970-01-14,91.92,92.40,90.88,91.65,10380000,91.65
9,1970-01-15,91.65,92.35,90.73,91.68,11120000,91.68

In [10]:
drop table stock;